## Manipulaci칩n de DataFrames

In [55]:
import pandas as pd
import numpy as np

import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

## Eliminaci칩n de NaNs (Not A Number)

In [57]:
nums = np.random.randint(100, 3000, (8, 4))
letters = np.reshape(list("abcd")*2, (8,1))
values = np.append(nums, letters, axis = 1)

fecha = pd.date_range("20230915", periods=8)

df = pd.DataFrame(values, index=fecha, columns=list("VWXYZ"))
df

               V     W     X     Y  Z
2023-09-15  1173  2453  1330  1257  a
2023-09-16  1934  1483  2576   135  b
2023-09-17   279   160   123  1787  c
2023-09-18  2295  2087  2885   429  d
2023-09-19   350  2125  2236  2419  a
2023-09-20  2349   611  1253  2707  b
2023-09-21  2414  2515  2194   447  c
2023-09-22  2636  2141   967   728  d

In [3]:
df.dtypes

V    object
W    object
X    object
Y    object
Z    object
dtype: object

In [58]:
types_dict = {
    'V': 'int64',
    'W': 'float64',
    'X': 'int64',
    'Y': 'float64'}

df = df.astype(types_dict)
df.dtypes

V      int64
W    float64
X      int64
Y    float64
Z     object
dtype: object

In [59]:
df['Y'].astype('object')

2023-09-15    1257.0
2023-09-16     135.0
2023-09-17    1787.0
2023-09-18     429.0
2023-09-19    2419.0
2023-09-20    2707.0
2023-09-21     447.0
2023-09-22     728.0
Freq: D, Name: Y, dtype: object

In [61]:
df['Y'] = df['Y'].astype('object')

In [64]:
df

               V       W     X       Y  Z
2023-09-15  1173  2453.0  1330  1257.0  a
2023-09-16  1934  1483.0  2576   135.0  b
2023-09-17   279   160.0   123  1787.0  c
2023-09-18  2295  2087.0  2885   429.0  d
2023-09-19   350  2125.0  2236  2419.0  a
2023-09-20  2349   611.0  1253  2707.0  b
2023-09-21  2414  2515.0  2194   447.0  c
2023-09-22  2636  2141.0   967   728.0  d

In [65]:
# EJERCICIO: Hacer funcion que asigne 'int64' a todas las columnas excepto Z
types_dict = {}
for i in df.columns:
    types_dict.update({i : 'int64'})
    
types_dict.pop('Z')

'int64'

In [66]:
df = df.astype(types_dict)
df.dtypes

V     int64
W     int64
X     int64
Y     int64
Z    object
dtype: object

In [67]:
df['X']*df['Y']

2023-09-15    1671810
2023-09-16     347760
2023-09-17     219801
2023-09-18    1237665
2023-09-19    5408884
2023-09-20    3391871
2023-09-21     980718
2023-09-22     703976
Freq: D, dtype: int64

In [68]:
sum(df['X']*df['Y'])

13962485

#### DataFrame con NaNs

In [69]:
df.loc['2023-09-17':'2023-09-20','W'] = np.nan
df

               V       W     X     Y  Z
2023-09-15  1173  2453.0  1330  1257  a
2023-09-16  1934  1483.0  2576   135  b
2023-09-17   279     NaN   123  1787  c
2023-09-18  2295     NaN  2885   429  d
2023-09-19   350     NaN  2236  2419  a
2023-09-20  2349     NaN  1253  2707  b
2023-09-21  2414  2515.0  2194   447  c
2023-09-22  2636  2141.0   967   728  d

In [70]:
df.loc['2023-09-15',['V', 'Z']] = np.nan
df.loc['2023-09-22',['Y', 'Z']] = np.nan

In [71]:
df

                 V       W     X       Y    Z
2023-09-15     NaN  2453.0  1330  1257.0  NaN
2023-09-16  1934.0  1483.0  2576   135.0    b
2023-09-17   279.0     NaN   123  1787.0    c
2023-09-18  2295.0     NaN  2885   429.0    d
2023-09-19   350.0     NaN  2236  2419.0    a
2023-09-20  2349.0     NaN  1253  2707.0    b
2023-09-21  2414.0  2515.0  2194   447.0    c
2023-09-22  2636.0  2141.0   967     NaN  NaN

In [73]:
#df = df.astype(types_dict)
#df.dtypes

In [74]:
df['X']*df['Y']

2023-09-15    1671810.0
2023-09-16     347760.0
2023-09-17     219801.0
2023-09-18    1237665.0
2023-09-19    5408884.0
2023-09-20    3391871.0
2023-09-21     980718.0
2023-09-22          NaN
Freq: D, dtype: float64

In [75]:
sum(df['X']*df['Y'])

nan

#### Eliminar NaNs debe ser uno de los primeros pasos en el an치lisis de datos.

Primero hay que tener una idea de la distrubuci칩n de los NaNs

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 8 entries, 2023-09-15 to 2023-09-22
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V       7 non-null      float64
 1   W       4 non-null      float64
 2   X       8 non-null      int64
 3   Y       7 non-null      float64
 4   Z       6 non-null      object
dtypes: float64(3), int64(1), object(1)
memory usage: 684.0+ bytes

In [78]:
df.isna().sum(axis=0)

V    1
W    4
X    0
Y    1
Z    2
dtype: int64

In [79]:
df

                 V       W     X       Y    Z
2023-09-15     NaN  2453.0  1330  1257.0  NaN
2023-09-16  1934.0  1483.0  2576   135.0    b
2023-09-17   279.0     NaN   123  1787.0    c
2023-09-18  2295.0     NaN  2885   429.0    d
2023-09-19   350.0     NaN  2236  2419.0    a
2023-09-20  2349.0     NaN  1253  2707.0    b
2023-09-21  2414.0  2515.0  2194   447.0    c
2023-09-22  2636.0  2141.0   967     NaN  NaN

In [80]:
df.dropna(axis=0, how='any') # elimina filas con al menos un NAN

                 V       W     X      Y  Z
2023-09-16  1934.0  1483.0  2576  135.0  b
2023-09-21  2414.0  2515.0  2194  447.0  c

In [81]:
df.dropna(axis=0, how='all') # elimina filas si todos son NAN

                 V       W     X       Y    Z
2023-09-15     NaN  2453.0  1330  1257.0  NaN
2023-09-16  1934.0  1483.0  2576   135.0    b
2023-09-17   279.0     NaN   123  1787.0    c
2023-09-18  2295.0     NaN  2885   429.0    d
2023-09-19   350.0     NaN  2236  2419.0    a
2023-09-20  2349.0     NaN  1253  2707.0    b
2023-09-21  2414.0  2515.0  2194   447.0    c
2023-09-22  2636.0  2141.0   967     NaN  NaN

In [82]:
df.dropna(axis=1, how='any')

               X
2023-09-15  1330
2023-09-16  2576
2023-09-17   123
2023-09-18  2885
2023-09-19  2236
2023-09-20  1253
2023-09-21  2194
2023-09-22   967

#### Una manera

In [83]:
df2 = df.drop('W',axis=1)

In [84]:
df2

                 V     X       Y    Z
2023-09-15     NaN  1330  1257.0  NaN
2023-09-16  1934.0  2576   135.0    b
2023-09-17   279.0   123  1787.0    c
2023-09-18  2295.0  2885   429.0    d
2023-09-19   350.0  2236  2419.0    a
2023-09-20  2349.0  1253  2707.0    b
2023-09-21  2414.0  2194   447.0    c
2023-09-22  2636.0   967     NaN  NaN

In [85]:
df2.dropna(axis=0, how='any', inplace = True)

In [86]:
df2

                 V     X       Y  Z
2023-09-16  1934.0  2576   135.0  b
2023-09-17   279.0   123  1787.0  c
2023-09-18  2295.0  2885   429.0  d
2023-09-19   350.0  2236  2419.0  a
2023-09-20  2349.0  1253  2707.0  b
2023-09-21  2414.0  2194   447.0  c

#### Otra manera

In [87]:
df.fillna(0)

                 V       W     X       Y  Z
2023-09-15     0.0  2453.0  1330  1257.0  0
2023-09-16  1934.0  1483.0  2576   135.0  b
2023-09-17   279.0     0.0   123  1787.0  c
2023-09-18  2295.0     0.0  2885   429.0  d
2023-09-19   350.0     0.0  2236  2419.0  a
2023-09-20  2349.0     0.0  1253  2707.0  b
2023-09-21  2414.0  2515.0  2194   447.0  c
2023-09-22  2636.0  2141.0   967     0.0  0

In [89]:
df['Z'].fillna('unknown')

2023-09-15    unknown
2023-09-16          b
2023-09-17          c
2023-09-18          d
2023-09-19          a
2023-09-20          b
2023-09-21          c
2023-09-22    unknown
Freq: D, Name: Z, dtype: object

In [90]:
df

                 V       W     X       Y    Z
2023-09-15     NaN  2453.0  1330  1257.0  NaN
2023-09-16  1934.0  1483.0  2576   135.0    b
2023-09-17   279.0     NaN   123  1787.0    c
2023-09-18  2295.0     NaN  2885   429.0    d
2023-09-19   350.0     NaN  2236  2419.0    a
2023-09-20  2349.0     NaN  1253  2707.0    b
2023-09-21  2414.0  2515.0  2194   447.0    c
2023-09-22  2636.0  2141.0   967     NaN  NaN

In [91]:
df['Z'].fillna('unknown', inplace=True)

In [92]:
df.fillna(0, inplace=True)

In [93]:
df

                 V       W     X       Y        Z
2023-09-15     0.0  2453.0  1330  1257.0  unknown
2023-09-16  1934.0  1483.0  2576   135.0        b
2023-09-17   279.0     0.0   123  1787.0        c
2023-09-18  2295.0     0.0  2885   429.0        d
2023-09-19   350.0     0.0  2236  2419.0        a
2023-09-20  2349.0     0.0  1253  2707.0        b
2023-09-21  2414.0  2515.0  2194   447.0        c
2023-09-22  2636.0  2141.0   967     0.0  unknown

____

## Apply

In [94]:
df.reset_index(inplace = True)
df

       index       V       W     X       Y        Z
0 2023-09-15     0.0  2453.0  1330  1257.0  unknown
1 2023-09-16  1934.0  1483.0  2576   135.0        b
2 2023-09-17   279.0     0.0   123  1787.0        c
3 2023-09-18  2295.0     0.0  2885   429.0        d
4 2023-09-19   350.0     0.0  2236  2419.0        a
5 2023-09-20  2349.0     0.0  1253  2707.0        b
6 2023-09-21  2414.0  2515.0  2194   447.0        c
7 2023-09-22  2636.0  2141.0   967     0.0  unknown

In [97]:
df['V2'] = df['V'].apply(np.sqrt) # np.sqrt(df['V'])

In [98]:
df

       index       V       W     X       Y        Z         V2
0 2023-09-15     0.0  2453.0  1330  1257.0  unknown   0.000000
1 2023-09-16  1934.0  1483.0  2576   135.0        b  43.977267
2 2023-09-17   279.0     0.0   123  1787.0        c  16.703293
3 2023-09-18  2295.0     0.0  2885   429.0        d  47.906158
4 2023-09-19   350.0     0.0  2236  2419.0        a  18.708287
5 2023-09-20  2349.0     0.0  1253  2707.0        b  48.466483
6 2023-09-21  2414.0  2515.0  2194   447.0        c  49.132474
7 2023-09-22  2636.0  2141.0   967     0.0  unknown  51.341991

In [99]:
df[['V', 'W', 'X']].apply(np.sum, axis=0) # ** axis 0 -> columnas

V    12257.0
W     8592.0
X    13564.0
dtype: float64

In [100]:
df[['V', 'W', 'X']].apply(np.sum, axis=1) #np.sum(df[['V', 'W', 'X']], axis=1)

0    3783.0
1    5993.0
2     402.0
3    5180.0
4    2586.0
5    3602.0
6    7123.0
7    5744.0
dtype: float64

In [101]:
def precio(v1):
    return f'${np.round(v1*0.8,1)} MXN'

In [102]:
df['precio'] = df['X'].apply(precio)
df

       index       V       W     X       Y        Z         V2       precio
0 2023-09-15     0.0  2453.0  1330  1257.0  unknown   0.000000  $1064.0 MXN
1 2023-09-16  1934.0  1483.0  2576   135.0        b  43.977267  $2060.8 MXN
2 2023-09-17   279.0     0.0   123  1787.0        c  16.703293    $98.4 MXN
3 2023-09-18  2295.0     0.0  2885   429.0        d  47.906158  $2308.0 MXN
4 2023-09-19   350.0     0.0  2236  2419.0        a  18.708287  $1788.8 MXN
5 2023-09-20  2349.0     0.0  1253  2707.0        b  48.466483  $1002.4 MXN
6 2023-09-21  2414.0  2515.0  2194   447.0        c  49.132474  $1755.2 MXN
7 2023-09-22  2636.0  2141.0   967     0.0  unknown  51.341991   $773.6 MXN

____

## Group By / Agregaciones

In [103]:
nums = np.random.randint(100, 3000, (8, 4))
letters = np.reshape(list("abcd")*2, (8,1))
values = np.append(nums, letters, axis = 1)

fecha = pd.date_range("20230915", periods=8)

df = pd.DataFrame(values, index=fecha, columns=list("VWXYZ"))
df

               V     W     X     Y  Z
2023-09-15  2985  1939  2267  1806  a
2023-09-16  2457  2842   775  1648  b
2023-09-17  1541  1923  1522  1510  c
2023-09-18  1792  1232  2187   517  d
2023-09-19   256  2658   545  2949  a
2023-09-20  2579  2540  2903  1095  b
2023-09-21  2677  2053  1569   506  c
2023-09-22   574  2568  2529  2434  d

In [104]:
df.groupby(['Z'])['V', 'X'].value_counts()

Z  V     X
a  256   545     1
   2985  2267    1
b  2457  775     1
   2579  2903    1
c  1541  1522    1
   2677  1569    1
d  1792  2187    1
   574   2529    1
dtype: int64

In [105]:
df.groupby(['Z'])['V', 'X'].min()

      V     X
Z
a   256  2267
b  2457  2903
c  1541  1522
d  1792  2187

In [106]:
df.groupby('Z')['V', 'X'].agg(['mean', 'median', 'std'])

            V                                X
         mean  median          std        mean  median          std
Z
a   1492628.0  1620.5  1929.694406   1133772.5  1406.0  1217.637877
b  12286289.5  2518.0    86.267027   3876451.5  1839.0  1504.723230
c   7706338.5  2109.0   803.273303   7610784.5  1545.5    33.234019
d    896287.0  1183.0   861.256059  10936264.5  2358.0   241.830519

In [41]:
df.agg(['sum', 'min'], axis=1)

                          sum   min
2023-09-15   168716511610332a  1610
2023-09-16    26129645341447b  1447
2023-09-17   261023461076130c  1076
2023-09-18  1519151418852840d  1514
2023-09-19  2661149528641279a  1279
2023-09-20   169511952241359b  1195
2023-09-21   172016777181813c  1677
2023-09-22    90010414581914d  1041

____

## Merge / Join

In [107]:
df

               V     W     X     Y  Z
2023-09-15  2985  1939  2267  1806  a
2023-09-16  2457  2842   775  1648  b
2023-09-17  1541  1923  1522  1510  c
2023-09-18  1792  1232  2187   517  d
2023-09-19   256  2658   545  2949  a
2023-09-20  2579  2540  2903  1095  b
2023-09-21  2677  2053  1569   506  c
2023-09-22   574  2568  2529  2434  d

In [108]:
df2

                 V     X       Y  Z
2023-09-16  1934.0  2576   135.0  b
2023-09-17   279.0   123  1787.0  c
2023-09-18  2295.0  2885   429.0  d
2023-09-19   350.0  2236  2419.0  a
2023-09-20  2349.0  1253  2707.0  b
2023-09-21  2414.0  2194   447.0  c

In [109]:
# union por indice
pd.merge(df, df2, left_index=True, right_index=True).sort_index()

             V_x     W   X_x   Y_x Z_x     V_y   X_y     Y_y Z_y
2023-09-16  2457  2842   775  1648   b  1934.0  2576   135.0   b
2023-09-17  1541  1923  1522  1510   c   279.0   123  1787.0   c
2023-09-18  1792  1232  2187   517   d  2295.0  2885   429.0   d
2023-09-19   256  2658   545  2949   a   350.0  2236  2419.0   a
2023-09-20  2579  2540  2903  1095   b  2349.0  1253  2707.0   b
2023-09-21  2677  2053  1569   506   c  2414.0  2194   447.0   c

In [110]:
df1_colFecha = df.reset_index()
df1_colFecha = df1_colFecha.rename(columns={'index':'Fecha'})
df1_colFecha

       Fecha     V     W     X     Y  Z
0 2023-09-15  2985  1939  2267  1806  a
1 2023-09-16  2457  2842   775  1648  b
2 2023-09-17  1541  1923  1522  1510  c
3 2023-09-18  1792  1232  2187   517  d
4 2023-09-19   256  2658   545  2949  a
5 2023-09-20  2579  2540  2903  1095  b
6 2023-09-21  2677  2053  1569   506  c
7 2023-09-22   574  2568  2529  2434  d

In [111]:
df2_colFecha = df2.reset_index()
df2_colFecha = df2_colFecha.rename(columns={'index':'Date_ZZ'})
df2_colFecha

     Date_ZZ       V     X       Y  Z
0 2023-09-16  1934.0  2576   135.0  b
1 2023-09-17   279.0   123  1787.0  c
2 2023-09-18  2295.0  2885   429.0  d
3 2023-09-19   350.0  2236  2419.0  a
4 2023-09-20  2349.0  1253  2707.0  b
5 2023-09-21  2414.0  2194   447.0  c

In [112]:
# Union por columna comun
pd.merge(df1_colFecha, df2_colFecha, left_on='Fecha', right_on='Date_ZZ')

       Fecha   V_x     W   X_x   Y_x Z_x    Date_ZZ     V_y   X_y     Y_y Z_y
0 2023-09-16  2457  2842   775  1648   b 2023-09-16  1934.0  2576   135.0   b
1 2023-09-17  1541  1923  1522  1510   c 2023-09-17   279.0   123  1787.0   c
2 2023-09-18  1792  1232  2187   517   d 2023-09-18  2295.0  2885   429.0   d
3 2023-09-19   256  2658   545  2949   a 2023-09-19   350.0  2236  2419.0   a
4 2023-09-20  2579  2540  2903  1095   b 2023-09-20  2349.0  1253  2707.0   b
5 2023-09-21  2677  2053  1569   506   c 2023-09-21  2414.0  2194   447.0   c

____

## 칈ndices m칰ltiples

In [113]:
datos1 = {
'X': [1,2,3],
'Y':[4,5,6]
}

datos2 = {
'W': [7,8,9],
'Z':[10,11,12]
}

In [115]:
df1 = pd.DataFrame(datos1, index=['a', 'b','c'])
df2 = pd.DataFrame(datos1, index=['d', 'e','f'])
df3 = pd.DataFrame(datos2, index=['a', 'b','c'])

In [116]:
df1

   X  Y
a  1  4
b  2  5
c  3  6

In [117]:
df2

   X  Y
d  1  4
e  2  5
f  3  6

In [118]:
df3

   W   Z
a  7  10
b  8  11
c  9  12

In [119]:
df = pd.concat([df1, df2, df3], axis=0, keys=['df_1', 'df_3'])
df

        X  Y
df_1 a  1  4
     b  2  5
     c  3  6
df_3 d  1  4
     e  2  5
     f  3  6

In [120]:
df.loc['df_1']

   X  Y
a  1  4
b  2  5
c  3  6

In [121]:
df.loc['df_1'].loc['b']

X    2
Y    5
Name: b, dtype: int64

In [122]:
df.index.get_level_values(0)

Index(['df_1', 'df_1', 'df_1', 'df_3', 'df_3', 'df_3'], dtype='object')

In [123]:
df.index.get_level_values(1)

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')